## Grouped aggregation

### What you will learn in this session

- Aggregating dataframs and columns
- Calculating grouped aggregations

### Examples from the intro

In [7]:
# importing the console_sales.csv file
import pandas as pd
vc_sales = pd.read_csv('console_sales.csv')

In [8]:
vc_sales.head()

,company,platform,year,sold_year,sold_total,sold_year_pct_change,decade
0,Microsoft,X360,2005,1178267,1178267,NaN,2000
1,Microsoft,X360,2006,6801532,7979799,577.248790,2000
2,Microsoft,X360,2007,7879552,15859351,98.743740,2000
3,Microsoft,X360,2008,10913123,26772474,68.811914,2000
4,Microsoft,X360,2009,10160518,36932992,37.951360,2000

#### Aggregating/Summarizing

In [108]:
# basic aggregation: sum
vc_sales.sum()

Unnamed: 0                                                           3240
company                 MicrosoftMicrosoftMicrosoftMicrosoftMicrosoftM...
platform                X360X360X360X360X360X360X360X360X360X360X360X3...
year                                                               163021
sold_year                                                       623846458
sold_total                                                     3610123211
sold_year_pct_change                                          5319.872485
decade                                                             162630
dtype: object

In [109]:
# basic aggregation: mean
vc_sales.mean()

Unnamed: 0              4.000000e+01
year                    2.012605e+03
sold_year               7.701808e+06
sold_total              4.456942e+07
sold_year_pct_change    7.492778e+01
decade                  2.007778e+03
dtype: float64

In [110]:
# basic aggregation for one column: max
vc_sales['sold_year'].max()

24188263

In [111]:
# sum of all numerical variables for each company
vc_sales.groupby('company').sum()

,Unnamed: 0,year,sold_year,sold_total,sold_year_pct_change,decade
company,,,,,,
Microsoft,171,38236,127402232,837059496,1298.148282,38140
Nintendo,819,52343,221219729,1201527986,1376.931320,52220
Sony,2250,72442,275224497,1571535729,2644.792882,72270

In [112]:
# sum of sold_total column for each company
vc_sales.groupby('company')['sold_total'].sum()

company
Microsoft     837059496
Nintendo     1201527986
Sony         1571535729
Name: sold_total, dtype: int64

In [113]:
# mean annual sales for each video game platform
vc_sales.groupby('platform')['sold_year'].mean()

platform
3DS     9.569641e+06
NS      1.472793e+07
PS3     7.249837e+06
PS4     1.536288e+07
PSP     8.010926e+06
PSV     1.992488e+06
Wii     1.014562e+07
WiiU    2.291760e+06
X360    6.530193e+06
XOne    7.084954e+06
Name: sold_year, dtype: float64

### Task 1 - Grouped aggregation

Run the code cell below to import the titanic dataset from the seaborn library.

In [10]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

The titanic dataset has data on the passengers from the famous shipwreck from 1912.

We will use the survived (0=died, 1=survived), age, pclass (passenger class) and sex columns.

In [11]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

1. Calculate the average survival rate.
2. Calculate the average survival rate for each level of sex.
3. Calculate the average age for each level of pclass.

In [1]:
# average survival rate

In [2]:
# average survival rate for each level of sex

In [8]:
# average age for each level of pclass

### Task 2 - Using more than one aggregation function

You can also calculate more than one statistic using the .agg() method. Have a look at the example below, where we calculate the mean and standard deviation.

In [68]:
vc_sales.groupby('company')['sold_year'].agg(['mean', 'std'])

                   mean           std
company
Microsoft  6.705381e+06  4.263350e+06
Nintendo   8.508451e+06  7.002776e+06
Sony       7.645125e+06  6.095570e+06

1. Calculate the mean, standard deviation, min and max of age.
2. Calcualte the mean, standard deviation, min and max of age for each level of survived.

In [3]:
# calculate the mean, standard deviation, min and max of age.

In [4]:
# calcualte the mean, standard deviation, min and max of age for each level of survived.